///实现pow(x, n)，即计算 x 的 n 次幂函数（即，x^n）。
///
///
/// 示例 1：
/// ```
/// 输入：x = 2.00000, n = 10
/// 输出：1024.00000
///```
/// 示例 2：
/// ```
/// 输入：x = 2.10000, n = 3
/// 输出：9.26100
/// ```
/// 示例 3：
/// ```
/// 输入：x = 2.00000, n = -2
/// 输出：0.25000
/// 解释：2-2 = 1/2^2 = 1/4 = 0.25
/// ```
/// 提示：
///
/// -100.0 <x< 100.0
/// -2^31<= n <=2^31-1
/// -10^4 <= x^n <= 10^4
///
/// 来源：力扣（LeetCode）
/// 链接：https:///leetcode-cn.com/problems/powx-n
/// 著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。
pub fn my_pow(x: f64, n: i32) -> f64 {
    let mut res = 1.0;
    let mut i = n;
    let mut x = x;
    while i != 0 {
        if i & 1 != 0 {
            res *= x;
        }
        x *= x;
        i = i/2;
    }
    if n < 0 { 1.0 / res } else { res }
}
