///给你一个 32 位的有符号整数 x ，返回 x 中每位上的数字反转后的结果。
///
/// 如果反转后整数超过 32 位的有符号整数的范围[−2^31, 2^31− 1] ，就返回 0。
///
/// 假设环境不允许存储 64 位整数（有符号或无符号）。
///
/// 示例 1：
/// ```
/// 输入：x = 123
/// 输出：321
/// ```
/// 示例 2：
/// ```
/// 输入：x = -123
/// 输出：-321
/// ```
/// 示例 3：
/// ```
/// 输入：x = 120
/// 输出：21
/// ```
/// 示例 4：
/// ```
/// 输入：x = 0
/// 输出：0
/// ```
pub fn reverse(x: i32) -> i32 {
    let mut n = 0i64;
    let mut x = x;
    while x != 0 {
        n = n * 10 + (x % 10) as i64 ;
        x = x / 10;
    }
    return if n > i32::MAX as i64 { 0 } else if n < i32::MIN as i64 {
        0
    } else {
        n as i32
    };
}

#[test]
fn test() {
    println!("{}", reverse(-2147483648));
}
