///给定一个整数 n，求以 1 ... n 为节点组成的二叉搜索树有多少种？
///
/// 示例:
///
/// 输入: 3
/// 输出: 5
/// 解释:
/// 给定 n = 3, 一共有 5 种不同结构的二叉搜索树:
///
///    1         3     3      2      1
///     \       /     /      / \      \
///      3     2     1      1   3      2
///     /     /       \                 \
///    2     1         2                 3
///
/// 1->1  2->2  3->5  4->14
pub fn num_trees(n: i32) -> i32 {
    //卡特兰数
    //C0=1 C(i+1)= 2(2*i+1)/(i+2)Ci
    //C0=1 C1=1 C2=2  C3=5 C4=14
    let mut res = 1;
    for i in 0..n {
        res = ((2.0 * (2 * i + 1) as f64 / (i + 2) as f64) * res as f64) as i32;
    }
    res
}

#[test]
fn test() {
    println!("{}", num_trees(3));
}
